[
  {"category": "Minerals", "fact_text": "Consuming plant-based iron (like spinach) with Vitamin C (like lemon or bell peppers) significantly increases iron absorption."},
  {"category": "Minerals", "fact_text": "Vitamin D is essential for absorbing calcium; without it, your body cannot effectively build bone mass."},
  {"category": "Minerals", "fact_text": "Magnesium plays a key role in muscle relaxation and can help prevent cramps and fatigue."},
  {"category": "Minerals", "fact_text": "Adequate potassium intake (found in bananas and potatoes) helps counteract the negative effects of sodium on blood pressure."},
  {"category": "Minerals", "fact_text": "Zinc is crucial for the development and function of immune cells and helps heal wounds."},
  {"category": "Minerals", "fact_text": "Heme iron found in meat is absorbed more efficiently by the body than non-heme iron found in plants."},
  {"category": "Minerals", "fact_text": "While sodium is necessary for fluid balance, excessive intake is linked to high blood pressure and heart strain."},
  {"category": "Minerals", "fact_text": "Brazil nuts are one of the richest dietary sources of selenium, a powerful antioxidant mineral."},
  {"category": "Minerals", "fact_text": "Phosphorus works with calcium to build strong bones and teeth and is needed for tissue repair."},
  {"category": "Minerals", "fact_text": "Iodine is vital for thyroid health, which regulates your metabolism."},
  {"category": "Minerals", "fact_text": "Copper helps your body make red blood cells and keeps nerve cells and your immune system healthy."},
  {"category": "Minerals", "fact_text": "Sodium, potassium, and magnesium are electrolytes that help regulate nerve and muscle function and hydration."},
  {"category": "Minerals", "fact_text": "Tannins found in tea and coffee can inhibit the absorption of iron if consumed during meals."},
  {"category": "Minerals", "fact_text": "Magnesium supplements or magnesium-rich foods can improve sleep quality by regulating neurotransmitters."},
  
  {"category": "Protein", "fact_text": "Protein has the highest thermic effect of food, meaning your body burns more calories digesting it than fats or carbs."},
  {"category": "Protein", "fact_text": "There are 9 amino acids your body cannot produce; you must get them from food sources."},
  {"category": "Protein", "fact_text": "Animal proteins are 'complete' (containing all 9 essential amino acids), while most plant proteins are 'incomplete' and need variety."},
  {"category": "Protein", "fact_text": "Consuming protein shortly after a workout helps repair muscle tissue and stimulate growth."},
  {"category": "Protein", "fact_text": "Quinoa is one of the few plant foods that is a complete protein, containing all essential amino acids."},
  {"category": "Protein", "fact_text": "Soy is one of the few plant proteins that contain all essential amino acids in good amounts."},
  {"category": "Protein", "fact_text": "Spreading protein intake across meals is more effective for muscle building than eating it all at once."},
  
  {"category": "Fats", "fact_text": "Vitamins A, D, E, and K require dietary fat to be absorbed by the body."},
  {"category": "Fats", "fact_text": "Omega-3 fatty acids, found in fatty fish, are crucial for brain health and reducing inflammation."},
  {"category": "Fats", "fact_text": "Trans fats raise your 'bad' cholesterol (LDL) and lower your 'good' cholesterol (HDL), increasing heart disease risk."},
  {"category": "Fats", "fact_text": "Monounsaturated fats found in olive oil and avocados can improve heart health and help regulate blood sugar."},
  {"category": "Fats", "fact_text": "Your body cannot make Omega-3 and Omega-6 fatty acids; they must come from your diet."},
  {"category": "Fats", "fact_text": "For most people, dietary cholesterol (like in eggs) has a minimal effect on blood cholesterol levels compared to saturated fat."},
  {"category": "Fats", "fact_text": "Avocados are not only rich in healthy fats but are also surprisingly high in fiber."},
  
  {"category": "Carbs", "fact_text": "Complex carbs (oats, brown rice) provide sustained energy, while simple carbs (sugar) cause rapid spikes and crashes."},
  {"category": "Carbs", "fact_text": "Soluble fiber (oats, apples) helps lower cholesterol; insoluble fiber (wheat bran) aids digestion and prevents constipation."},
  {"category": "Carbs", "fact_text": "Your brain consumes about 20% of your daily energy, primarily in the form of glucose (carbohydrates)."},
  {"category": "Carbs", "fact_text": "For every gram of carbohydrate stored in the body (as glycogen), the body stores about 3 to 4 grams of water."},
  {"category": "Carbs", "fact_text": "The Glycemic Index measures how quickly food raises blood sugar; low GI foods provide more stable energy."},
  {"category": "Carbs", "fact_text": "Most adults need 25-30g of fiber daily, but the average intake is only about 15g."},
  
  {"category": "Vitamins", "fact_text": "Vitamin B12 is naturally found almost exclusively in animal products; vegans often need supplements."},
  {"category": "Vitamins", "fact_text": "Vitamin A helps form rhodopsin, a pigment in the eye that helps you see in low light."},
  {"category": "Vitamins", "fact_text": "Vitamin K is essential for blood clotting; without it, even small cuts could bleed excessively."},
  {"category": "Vitamins", "fact_text": "Vitamin E acts as an antioxidant, protecting cells from damage caused by free radicals."},
  {"category": "Vitamins", "fact_text": "Vitamin D is unique because your body can produce it when your skin is exposed to sunlight."},
  {"category": "Vitamins", "fact_text": "Folate is the natural form of Vitamin B9 found in foods; folic acid is the synthetic form used in supplements."},
  {"category": "Vitamins", "fact_text": "Vitamin C is sensitive to heat; cooking vegetables for too long can destroy a significant amount of it."},
  {"category": "Vitamins", "fact_text": "B-vitamins don't provide energy themselves, but they help convert the food you eat into usable energy."},
  {"category": "Vitamins", "fact_text": "The body converts beta-carotene (found in orange vegetables like carrots) into Vitamin A as needed."},
  {"category": "Vitamins", "fact_text": "Vitamins C and E work better together than alone in protecting cells from oxidative stress."},
  {"category": "Vitamins", "fact_text": "Riboflavin (B2) is crucial for breaking down proteins, fats, and carbohydrates and is vital for the body's energy supply."},
  {"category": "Vitamins", "fact_text": "Niacin (B3) helps keep your nervous system, digestive system, and skin healthy."},
  {"category": "Vitamins", "fact_text": "Choline is essential for liver function, normal brain development, and muscle movement."},
  {"category": "Vitamins", "fact_text": "The body cannot store Vitamin C, so you need to consume it regularly through your diet."},
  
  {"category": "Hydration", "fact_text": "Even mild dehydration (1-2% loss of body fluid) can impair cognitive function and concentration."},
  {"category": "Hydration", "fact_text": "About 20% of your daily water intake typically comes from the food you eat, especially fruits and vegetables."},
  {"category": "Hydration", "fact_text": "By the time you feel thirsty, you are likely already slightly dehydrated."},
  {"category": "Hydration", "fact_text": "Chia seeds can absorb up to 10-12 times their weight in water, helping with hydration and fullness."},
  
  {"category": "Metabolism", "fact_text": "Basal Metabolic Rate (BMR) is the number of calories your body burns at rest just to keep vital organs functioning."},
  {"category": "Metabolism", "fact_text": "Digestion itself burns calories; protein burns the most, followed by carbs, then fats."},
  {"category": "Metabolism", "fact_text": "Muscle tissue burns more calories at rest than fat tissue, boosting your metabolism."},
  {"category": "Metabolism", "fact_text": "Eating frequent small meals vs. fewer large meals has a negligible effect on overall metabolism (total calories matter more)."},
  {"category": "Metabolism", "fact_text": "Metabolism naturally slows down with age, primarily due to a loss of muscle mass."},
  {"category": "Metabolism", "fact_text": "A 500 calorie daily deficit typically leads to about 0.5kg (1lb) weight loss per week."},
  
  {"category": "Food Tips", "fact_text": "Spinach is high in calcium, but also high in oxalates, which can block calcium absorption."},
  {"category": "Food Tips", "fact_text": "Cooked tomatoes contain higher levels of absorbable lycopene (a powerful antioxidant) than raw tomatoes."},
  {"category": "Food Tips", "fact_text": "The egg yolk contains most of the egg's vitamins and minerals, while the white is mostly protein."},
  {"category": "Food Tips", "fact_text": "Crushing or chopping garlic and letting it sit for a few minutes before cooking activates its beneficial compounds."},
  {"category": "Food Tips", "fact_text": "Dark berries (blueberries, blackberries) are among the highest antioxidant foods available."},
  {"category": "Food Tips", "fact_text": "Leafy greens like kale and spinach are among the most nutrient-dense foods per calorie."},
  {"category": "Food Tips", "fact_text": "Smaller fish (like sardines) typically contain less mercury than larger predatory fish (like swordfish)."},
  {"category": "Food Tips", "fact_text": "Beans and lentils are excellent sources of both fiber and protein, making them highly satiating."},
  {"category": "Food Tips", "fact_text": "Dark chocolate (70% cocoa or higher) is rich in minerals like iron and magnesium and contains antioxidants."},
  {"category": "Food Tips", "fact_text": "Greek yogurt typically has double the protein and half the sugar of regular yogurt."},
  {"category": "Food Tips", "fact_text": "Broccoli, cauliflower, and Brussels sprouts contain compounds linked to lower cancer risk."},
  {"category": "Food Tips", "fact_text": "Cinnamon has been shown to help lower blood sugar levels and improve insulin sensitivity."},
  {"category": "Food Tips", "fact_text": "Frozen vegetables are often flash-frozen at peak ripeness and can be just as nutritious as fresh ones."},
  {"category": "Food Tips", "fact_text": "Nitrates found in beets and leafy greens can improve blood flow and exercise performance."},
  {"category": "Food Tips", "fact_text": "Polyphenols found in tea, coffee, and berries are plant compounds that boost digestion and brain health."},
  {"category": "Food Tips", "fact_text": "Curcumin, the active compound in turmeric, has powerful anti-inflammatory effects (enhanced by black pepper)."},
  
  {"category": "Digestion", "fact_text": "Eating slowly allows your brain time to receive the 'fullness' signal from your stomach, preventing overeating."},
  {"category": "Digestion", "fact_text": "Your gut contains trillions of bacteria that influence everything from digestion to mood and immunity."},
  {"category": "Digestion", "fact_text": "Probiotics are live beneficial bacteria found in fermented foods like yogurt, kefir, and sauerkraut."},
  {"category": "Digestion", "fact_text": "Prebiotics are types of fiber (like in garlic and onions) that feed the healthy bacteria in your gut."},
  {"category": "Digestion", "fact_text": "Ultra-processed foods often lack fiber and nutrients while being calorie-dense, leading to easy overconsumption."},
  {"category": "Digestion", "fact_text": "Ingredients on a nutrition label are listed in descending order by weight."},
  {"category": "Digestion", "fact_text": "Sugar appears under many names on labels, including high fructose corn syrup, dextrose, and cane juice."},
  {"category": "Digestion", "fact_text": "Foods high in sugar and fat but low in nutrients supply 'empty calories' that provide energy without nourishment."},
  {"category": "Digestion", "fact_text": "Eating a variety of colorful vegetables ensures you get a diverse range of vitamins and phytonutrients."},
  {"category": "Digestion", "fact_text": "Thoroughly chewing food is the first step of digestion and helps your body absorb more nutrients."},
  {"category": "Digestion", "fact_text": "Sugary drinks don't trigger fullness signals the same way solid food does, leading to excess calorie intake."},
  {"category": "Digestion", "fact_text": "Chronic stress can negatively impact digestion and nutrient absorption."},
  {"category": "Digestion", "fact_text": "Plate sizes have grown over the decades, leading to larger portion sizes and increased calorie intake."},
  {"category": "Digestion", "fact_text": "Cravings are often psychological or due to blood sugar crashes rather than actual nutrient deficiencies."},
  
  {"category": "General", "fact_text": "Tryptophan, an amino acid found in turkey and milk, is a precursor to serotonin, which regulates sleep."},
  {"category": "General", "fact_text": "Not all nutrients in food are absorbed; cooking methods and food combinations affect bioavailability."},
  {"category": "General", "fact_text": "Capsaicin, the compound that makes chili peppers spicy, can slightly boost metabolism and reduce appetite."},
  {"category": "General", "fact_text": "Insulin is the hormone that acts as a key to let glucose into cells to be used for energy."},
  {"category": "General", "fact_text": "The recommended daily sodium limit is 2,300mg - about 1 teaspoon of salt."},
  {"category": "General", "fact_text": "Planning meals ahead reduces the likelihood of making unhealthy food choices."},
  {"category": "General", "fact_text": "Consistency in diet and nutrition matters far more than occasional 'perfect' or 'cheat' meals."},

  {"category": "Vitamins", "fact_text": "Vitamin C supports your immune system and helps your body heal wounds faster."},
  {"category": "Vitamins", "fact_text": "Vitamin D helps your body absorb calcium, which is essential for strong bones and teeth."},
  {"category": "Vitamins", "fact_text": "Folate (Vitamin B9) is especially important during pregnancy for proper development of the baby's brain and spine."},
  {"category": "Minerals", "fact_text": "Iron carries oxygen in your blood to all parts of your body; low iron causes fatigue and weakness."},
  {"category": "Minerals", "fact_text": "Calcium is the most abundant mineral in your body and is essential for bone health, muscle function, and nerve signaling."},
  {"category": "Food Tips", "fact_text": "Salmon is one of the best sources of Omega-3 fatty acids, which support heart and brain health."},
  {"category": "Food Tips", "fact_text": "Bell peppers contain more Vitamin C than oranges, ounce for ounce."},
  {"category": "Food Tips", "fact_text": "Whole fruits are healthier than fruit juice because they contain fiber that slows sugar absorption."},
  {"category": "Digestion", "fact_text": "Fiber helps you feel full longer, aids digestion, and can help maintain healthy cholesterol levels."}
]

